{
  "activity_name": "com.mobisystems.office/com.mobisystems.office.DialogsFullScreenActivity", 
  "activity": {
    "root": {
      "scrollable-horizontal": false, 
      "draw": true, 
      "ancestors": [
        "android.widget.FrameLayout", 
        "android.view.ViewGroup", 
        "android.view.View", 
        "java.lang.Object"
      ], 
      "clickable": false, 
      "pressed": "not_pressed", 
      "focusable": false, 
      "long-clickable": false, 
      "enabled": true, 
      "bounds": [
        0, 
        0, 
        1440, 
        2392
      ], 
      "visibility": "visible", 
      "content-desc": [
        null
      ], 
      "rel-bounds": [
        0, 
        0, 
        1440, 
        2392
      ], 
      "focused": false, 
      "selected": false, 
      "scrollable-vertical": false, 
      "children": [
        {
          "scrollable-horizontal": false, 
          "draw": true, 
          "ancestors": [
            "android.view.ViewGroup", 
            "android.view.View", 
            "java.lang.Object"
          ], 
          "clickable": false, 
          "pressed": "not_pressed", 
          "focusable": false, 
          "long-clickable": false, 
          "enabled": true, 
          "bounds": [
            0, 
            0, 
            1440, 
            2392
          ], 
          "visibility": "visible", 
          "content-desc": [
            null
          ], 
          "rel-bounds": [
            0, 
            0, 
            1440, 
            2392
          ], 
          "focused": false, 
          "selected": false, 
          "scrollable-vertical": false, 
          "children": [
            {
              "resource-id": "android:id/action_mode_bar_stub", 
              "adapter-view": false, 
              "pointer": "1ac9733", 
              "scrollable-horizontal": false, 
              "ancestors": [
                "android.view.View", 
                "java.lang.Object"
              ], 
              "selected": false, 
              "content-desc": [
                null
              ], 
              "rel-bounds": [
                0, 
                0, 
                0, 
                0
              ], 
              "draw": true, 
              "focusable": false, 
              "long-clickable": false, 
              "visibility": "gone", 
              "focused": false, 
              "clickable": false, 
              "abs-pos": true, 
              "class": "android.view.ViewStub", 
              "visible-to-user": false, 
              "package": "android", 
              "enabled": true, 
              "bounds": [
                0, 
                0, 
                0, 
                0
              ], 
              "pressed": "not_pressed", 
              "scrollable-vertical": false
            }, 
            {
              "resource-id": "android:id/content", 
              "adapter-view": false, 
              "pointer": "1001af0", 
              "children": [
                {
                  "scrollable-horizontal": false, 
                  "draw": false, 
                  "ancestors": [
                    "android.widget.FrameLayout", 
                    "android.view.ViewGroup", 
                    "android.view.View", 
                    "java.lang.Object"
                  ], 
                  "clickable": false, 
                  "pressed": "not_pressed", 
                  "focusable": true, 
                  "long-clickable": false, 
                  "enabled": true, 
                  "bounds": [
                    0, 
                    0, 
                    1440, 
                    2392
                  ], 
                  "visibility": "visible", 
                  "content-desc": [
                    null
                  ], 
                  "rel-bounds": [
                    0, 
                    0, 
                    1440, 
                    2392
                  ], 
                  "focused": false, 
                  "selected": false, 
                  "scrollable-vertical": true, 
                  "children": [
                    {
                      "text": "OfficeSuite - Libraries used \n\nOfficeSuite\n\nThis Product includes:\n\nApache POI\n\nApache POI is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nProject home page:\nhttp://poi.apache.org\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nThe Independent JPEG Group's JPEG software\n\nOfficeSuite is based in part on the work of the Independent JPEG Group.\n\nCopyright © 1991-2010, Thomas G. Lane, Guido Vollbeding\n\nProject home page:\nhttp://www.ijg.org\n\nDejaVu fonts\n\nCopyright © 2003 by Bitstream, Inc. \nAll Rights Reserved. \nBitstream Vera is a trademark of Bitstream, Inc. \n\nProject home page:\nhttp://dejavu-fonts.org/wiki/Main_Page\n\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of the fonts accompanying this license (\"Fonts\") and associated documentation files (the \"Font Software\"), to reproduce and distribute the Font Software, including without limitation the rights to use, copy, merge, publish, distribute, and/or sell copies of the Font Software, and to permit persons to whom the Font Software is furnished to do so, subject to the following conditions: \nThe above copyright and trademark notices and this permission notice shall be included in all copies of one or more of the Font Software typefaces. \nThe Font Software may be modified, altered, or added to, and in particular the designs of glyphs or characters in the Fonts may be modified and additional glyphs or characters may be added to the Fonts, only if the fonts are renamed to names not containing either the words \"Bitstream\" or the word \"Vera\". \nThis License becomes null and void to the extent applicable to Fonts or Font Software that has been modified and is distributed under the \"Bitstream Vera\" names. \nThe Font Software may be sold as part of a larger software package but no copy of one or more of the Font Software typefaces may be sold by itself. \nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL BITSTREAM OR THE GNOME FOUNDATION BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, INCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM OTHER DEALINGS IN THE FONT SOFTWARE. \nExcept as contained in this notice, the names of Gnome, the Gnome Foundation, and Bitstream Inc., shall not be used in advertising or otherwise to promote the sale, use or other dealings in this Font Software without prior written authorization from the Gnome Foundation or Bitstream Inc., respectively. For further information, contact: fonts at gnome dot org.\n\nAdobe Glyph List\n\nCopyright © 1997,1998,2002,2007 Adobe Systems Incorporated\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this documentation file to use, copy, publish, distribute, sublicense, and/or sell copies of the documentation, and to permit others to do the same, provided that:\n- No modification, editing or other alteration of this document is allowed; and\n- The above copyright notice and this permission notice shall be included in all copies of the documentation.\nPermission is hereby granted, free of charge, to any person obtaining a copy of this documentation file, to create their own derivative works from the content of this document to use, copy, publish, distribute, sublicense, and/or sell the derivative works, and to permit others to do the same, provided that the derived work is not represented as being a copy or version of this document.\n\nAdobe shall not be liable to any party for any loss of revenue or profit or for indirect, incidental, special, consequential, or other similar damages, whether based on tort (including without limitation negligence or strict liability), contract or other legal or equitable grounds even if Adobe has been advised or had reason to know of the possibility of such damages. The Adobe materials are provided on an \"AS IS\" basis. Adobe specifically disclaims all express, statutory, or implied warranties relating to the Adobe materials, including but not limited to those concerning merchantability or fitness for a particular purpose or non-infringement of any third party rights regarding the Adobe materials.\n\nApache Commons\n\nApache Commons is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nProject home page:\nhttp://commons.apache.org\n\nExpat\n\nPortions based on the Expat XML parser. Expat XML parser is Copyright © 1998, 1999, 2000 Thai Open Source Software Center Ltd and Clark Cooper Copyright © 2001, 2002, 2003, 2004, 2005, 2006 Expat maintainers.\n\nOpenSSL\n\nThis product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit.\nhttp://www.openssl.org\n\nlibCurl\n\nThis software includes libCurl. \nlibCurl is copyright © 1996 - 2010, Daniel Stenberg, <daniel@haxx.se>. All rights reserved.\n\nGoogle APIs Client Library for Java\n\nGoogle APIs Client Library for Java is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nProject home page:\nhttp://code.google.com/p/google-api-java-client/\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nThe Android robot is reproduced or modified from work created and shared by Google and used according to terms described in the Creative Commons 3.0 Attribution License.\n\nSlidingMenu\n\nSlidingMenu is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nProject home page:\nhttps://github.com/jfeinstein10/SlidingMenu\n\njuniversalchardet\n\nLicensed under the Mozilla Public License Version 1.1.\n\nNo modifications to the Covered Code have been implemented.\n\nProject home page:\nhttp://code.google.com/p/juniversalchardet\n\nAdobe CMap files\nCopyright 1990-2010 Adobe Systems Incorporated.\nAll Rights Reserved.\nPostScript and Display PostScript are trademarks of Adobe Systems Incorporated which may be registered in certain jurisdictions.\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. \nNeither the name of Adobe Systems Incorporated nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. \nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nAES Library\n\nCopyright (c) 1998-2013, Brian Gladman, Worcester, UK. All rights reserved.\nThe redistribution and use of this software (with or without changes) is allowed without the payment of fees or royalties provided that: source code distributions include the above copyright notice, this list of conditions and the following disclaimer; binary distributions include the above copyright notice, this list of conditions and the following disclaimer in their documentation.\nThis software is provided 'as is' with no explicit or implied warranties\nin respect of its operation, including, but not limited to, correctness\nand fitness for purpose.\n\nFreeType\n\nPortions of this software are copyright © 2013 The FreeType\nProject (http://www.freetype.org). All rights reserved.\n\nJPedal\n\nProject home page:\nhttp://www.jpedal.org\n\n(C) Copyright 1997-2008, IDRsolutions and Contributors.\nMain Developer: Simon Barnett\nCopyright (c) 2008, IDRsolutions\nAll rights reserved.\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n* Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n* Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n* Neither the name of the IDRsolutions nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\nTHIS SOFTWARE IS PROVIDED BY IDRsolutions \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL IDRsolutions BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nopenjpeg\n\nProject home page:\nhttp://www.openjpeg.org\n\nCopyright (c) 2002-2012, Communications and Remote Sensing Laboratory, Universite catholique de Louvain (UCL), Belgium\nCopyright (c) 2002-2012, Professor Benoit Macq\nCopyright (c) 2003-2012, Antonin Descampe\nCopyright (c) 2003-2009, Francois-Olivier Devaux\nCopyright (c) 2005, Herve Drolon, FreeImage Team\nCopyright (c) 2002-2003, Yannick Verschueren\nCopyright (c) 2001-2003, David Janssens\nCopyright (c) 2011-2012, Centre National d'Etudes Spatiales (CNES), France\nCopyright (c) 2012, CS Systemes d'Information, France\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 'AS IS' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\njsoup\n\nProject home page:\nhttp://jsoup.org\n\nCopyright (c) 2009 - 2013 Jonathan Hedley (jonathan@hedley.net)\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nmaterial-dialogs\n\nProject home page:\nhttps://github.com/afollestad/material-dialogs\n\nThe MIT License (MIT) \nCopyright (c) 2015 Aidan Michael Follestad\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nApache HttpComponents\n\nProject home page:\nhttps://hc.apache.org/index.html\n\nApache HttpComponents is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nSardine\n\nProject home page:\nhttps://github.com/lookfirst/sardine\n\nCopyright 2013 Jon Scott Stevens\n\nSardine is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nJackson\n\nProject home page:\nhttps://github.com/FasterXML/jackson\n\nJackson is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\nXZ for Java\n\nProject home page:\nhttp://tukaani.org/xz/java.html\n\nThis Java implementation of XZ has been put into the public domain. All the files in the package have been written by Lasse Collin, but some files are heavily based on public domain code written by Igor Pavlov.\n\nandroid-support-v4-preferencefragment\n\nProject home page:\nhttps://github.com/kolavar/android-support-v4-preferencefragment\n\nandroid-support-v4-preferencefragment is licensed under the Apache License, Version 2.0. You may obtain a copy of the license at http://www.apache.org/licenses/LICENSE-2.0\n\n", 
                      "resource-id": "com.mobisystems.office:id/doc_view", 
                      "adapter-view": false, 
                      "pointer": "8fb82ee", 
                      "scrollable-horizontal": false, 
                      "ancestors": [
                        "android.widget.TextView", 
                        "android.view.View", 
                        "java.lang.Object"
                      ], 
                      "selected": false, 
                      "content-desc": [
                        null
                      ], 
                      "rel-bounds": [
                        0, 
                        0, 
                        1440, 
                        34378
                      ], 
                      "draw": false, 
                      "focusable": false, 
                      "long-clickable": false, 
                      "visibility": "visible", 
                      "focused": false, 
                      "clickable": false, 
                      "abs-pos": true, 
                      "class": "android.support.v7.widget.x", 
                      "visible-to-user": true, 
                      "package": "com.mobisystems.office", 
                      "enabled": true, 
                      "bounds": [
                        0, 
                        0, 
                        1440, 
                        2392
                      ], 
                      "pressed": "not_pressed", 
                      "scrollable-vertical": false
                    }
                  ], 
                  "adapter-view": false, 
                  "abs-pos": true, 
                  "pointer": "ae0c869", 
                  "class": "android.widget.ScrollView", 
                  "visible-to-user": true
                }
              ], 
              "scrollable-horizontal": false, 
              "ancestors": [
                "android.view.ViewGroup", 
                "android.view.View", 
                "java.lang.Object"
              ], 
              "selected": false, 
              "content-desc": [
                null
              ], 
              "rel-bounds": [
                0, 
                0, 
                1440, 
                2392
              ], 
              "draw": true, 
              "focusable": false, 
              "long-clickable": false, 
              "visibility": "visible", 
              "focused": false, 
              "clickable": false, 
              "abs-pos": true, 
              "class": "android.widget.FrameLayout", 
              "visible-to-user": true, 
              "package": "android", 
              "enabled": true, 
              "bounds": [
                0, 
                0, 
                1440, 
                2392
              ], 
              "pressed": "not_pressed", 
              "scrollable-vertical": false
            }
          ], 
          "adapter-view": false, 
          "abs-pos": true, 
          "pointer": "2361ea2", 
          "class": "android.widget.LinearLayout", 
          "visible-to-user": true
        }
      ], 
      "adapter-view": false, 
      "abs-pos": true, 
      "pointer": "902726d", 
      "class": "com.android.internal.policy.PhoneWindow$DecorView", 
      "visible-to-user": true
    }, 
    "added_fragments": [], 
    "active_fragments": []
  }, 
  "is_keyboard_deployed": false, 
  "request_id": "822"
}